# SSEPointVisibilitySettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SSEPointVisibilitySettings Class
Members See Also
---
Represents the settings contained in the document associated to the point display of Floor, Roof and Toposolid. for serialization public api methods
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class SSEPointVisibilitySettings : Element
```

Visual Basic
---
```text
Public Class SSEPointVisibilitySettings _
	Inherits Element
```

Visual C++
---
```text
public ref class SSEPointVisibilitySettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SSEPointVisibilitySettings
# See Also
SSEPointVisibilitySettings Members
Autodesk.Revit.DB Namespace